Repository: MaksimLevchenko/lightshot_parser_mobile
Catalog: lib/l10n/intl_*.arb
Languages: ru, uk

source: Are you sure you want to delete this image?
ru: Вы уверены, что хотите удалить это изображение?
uk: Ви впевнені, що хочете видалити це зображення?

source: Cancel
ru: Отменить
uk: Скасувати

# clearImages
source: Delete all images
ru: Удалить все изображения
uk: Видалити всі зображення

source: Confirm deletion
ru: Подтвердите удаление
uk: Підтвердьте видалення

source: Delete
ru: Удалить
uk: Видалити

# download
source: Begin downloading
ru: Начать скачивание
uk: Почати скачування

# downloadedImagesOfWantednumofimages
source: {images, plural, zero{The images have not been downloaded yet} one{Downloaded 1 image out of {wantedNumOfImages}} other{{images} images out of {wantedNumOfImages} have been downloaded}}
ru: {images, plural, zero{Скачано 0 изображений из {wantedNumOfImages}} one{Скачано {images} изображение из {wantedNumOfImages}} few{Скачано {images} изображения из {wantedNumOfImages}} many{Скачано {images} изображений из {wantedNumOfImages}} other{Скачано {images} изображений из {wantedNumOfImages}}}
uk: {images, plural, zero{Завантажено 0 зображень з {wantedNumOfImages}} one{Завантажено 1 зображення з {wantedNumOfImages}} few{Завантажено {images} зображень з {wantedNumOfImages}} many{Завантажено {images} зображень з {wantedNumOfImages}} other{Завантажено {images} зображень з {wantedNumOfImages}}}

source: Download error. Try to change VPN
ru: Ошибка при загрузке. Попробуйте сменить VPN
uk: Помилка під час завантаження. Спробуйте змінити VPN

source: Enter the number of images to download
ru: Введите количество изображений для загрузки
uk: Введіть кількість зображень для завантаження

source: Enter the starting address
ru: Введите начальный адрес
uk: Введіть початкову адресу

source: Error: {error}
ru: Ошибка: {error}
uk: Помилка: {error}

source: Error: {error} \nPlease try again
ru: Ошибка: {error} Пожалуйста, попробуйте еще раз
uk: Помилка: {error} Будь ласка, спробуйте ще раз

# galleryAppBar
source: Gallery
ru: Галерея
uk: Галерея

source: Image deleted
ru: Изображение удалено
uk: Зображення видалено

# imageSavedToPath
source: Image saved to {newPath}
ru: Изображение сохранено в {newPath}
uk: Зображення збережено в {newPath}

# noDownloadFolderFound
source: The download folder was not found
ru: Папка для загрузки не найдена
uk: Папку для завантаження не знайдено

# noPhotos
source: There are no images
ru: Изображений нет
uk: Зображення немає

# numberOfImagesToDownload
source: The desired number of images
ru: Желаемое количество картинок
uk: Бажана кількість зображень

source: Permission denied
ru: Разрешение отклонено пользователем
uk: Дозвіл відхилено користувачем

source: Photo Viewer
ru: Просмотр изображений
uk: Перегляд зображень

source: Please enter a address with only a {mask}
ru: Пожалуйста, введите адрес, состоящий только из {mask}
uk: Будь ласка, введіть адресу лише з a {mask}

source: Please enter a max length address
ru: Пожалуйста, введите адрес максимальной длины
uk: Будь ласка, введіть адресу максимальної довжини

source: Please enter a number greater than 0
ru: Пожалуйста, введите число больше 0
uk: Будь ласка, введіть число більше 0

# pleaseEnterAValidNumber
source: Please enter a number
ru: Пожалуйста, введите число
uk: Будь ласка, введіть число

source: Please enter the correct data
ru: Пожалуйста, введите правильные данные
uk: Будь ласка, введіть правильні дані

source: Please enter the number of images to download
ru: Пожалуйста, введите количество изображений для загрузки
uk: Будь ласка, введіть кількість зображень для завантаження

source: Please enter the starting address
ru: Пожалуйста, введите начальный адрес
uk: Будь ласка, введіть початкову адресу

source: Recreate database
ru: Пересоздать базу данных
uk: Перебудувати базу даних

source: Save
ru: Сохранить
uk: Зберегти

source: See all
ru: Смотреть все
uk: Дивитись все

source: Settings
ru: Настройки
uk: Налаштування

source: Settings saved
ru: Настройки сохранены
uk: Налаштування збережені

# shareImage
source: Check out this image from Lightshot Parser!
ru: Посмотрите на это изображение из Lightshot Parser! https://github.com/MaksimLevchenko/lightshot_parser_mobile
uk: Подивіться це зображення з Lightshot Parser!

source: Starting address
ru: Начальный адрес
uk: Початкова адреса

source: Unknown error: {e}. Please contact to the dev
ru: Неизвестная ошибка: {e}. Пожалуйста, обратитесь к разработчику
uk: Невідома помилка: {e}. Будь ласка, зверніться до розробника

source: Use new addresses
ru: Использовать новые адреса
uk: Використовувати нові адреси

source: Use random addresses
ru: Использовать случайные адреса
uk: Використовуйте випадкові адреси
